{
    "fullpage-french-1.png": "Scott Joplin, né le 24 novembre 1868 au Texas, est un pianiste et compositeur afro-américain. Bien qu'ayant écrit des œuvres dans plusieurs styles, y compris le classique et l'opéra, sa notoriété tient principalement à ses compositions de musique ragtime. Sa musicalité, son talent et son importance dans l’histoire du ragtime et de la musique américaine sont exceptionnels.",
    "fullpage-french-2.png": "Le \"Maple Leaf Rag\", en la bémol majeur, est un des ragtimes de Scott Joplin les plus connus avec le célèbre \"The Entertainer\". Le \"Maple Leaf Rag\" a été composé en 1899, peu après son \"Original Rag\" qui, lui, a été un échec.\nIl est possible que ce ragtime ait été nommé d'après le \"Maple Leaf Club\", un club où Scott Joplin venait régulièrement jouer.",
    "sample_1.png": "J'étudie français.",
    "text-lines-1.jpeg": "Kraken HTR\nTasks:\nCompare French HTR accuracy with finetuned TrOCR.\nSet up comparison logic:\nKraken\nTrOCR\nEvaluate page segmentation performance\nCan these models run on end-user computers?\nKraken?\nTrOCR?\n",
    "text-lines-6.jpeg": "This is another mix of drawings and diagrams:\nThe above drawing is not text and should not be recognized as such.\n This diagram has some text:\nThis is more text.\nThis is even more.",
    "text-lines-9.jpeg": "TrOCR vs Kraken\nAfter fine-tuning, TrOCR seems to have much better single-line accuracy than Kraken. However, Kraken has image segmentation - recognizing lines of text in image built-in. At present, this diference in accuracy may just be because Kraken has not been fine-tuned on many types of handwriting.\nIf Kraken still has poor performance post fine-tuning then one option could be to use Kraken for segmentation and TrOCR for text recognition.\n Also - is Kraken's image segmentation good enough?",
    "text-lines-9_20.jpeg": "TrOCR vs Kraken\nAfter fine-tuning, TrOCR seems to have much better single-line accuracy than Kraken. However, Kraken has image segmentation - recognizing lines of text in image built-in. At present, this diference in accuracy may just be because Kraken has not been fine-tuned on many types of handwriting.\nIf Kraken still has poor performance post fine-tuning then one option could be to use Kraken for segmentation and TrOCR for text recognition.\n Also - is Kraken's image segmentation good enough?",
    "text-lines-3.jpeg": "C'est un example & un text en français.\nUn deuxième ligue de texte.\nUne troisième ligue de texte.",
    "text-lines-4.jpeg": "This is printed, multi-line text written on unlined paper. This text is written in Enlighs and should be divided into 3 or 4 lines.",
    "text-lines-5.jpeg": "This is cursive text written in English on unlined paper. It should be divided into 3 lines by the segmentation.",
    "text-lines-7.jpeg": "This is a page with well-spaced lines of text to be recognized and segmented.",
    "text-lines-8.jpeg": "This is another test of cursive multi0lien handwriting, in a portrait orientation. This page should contains several lines of text.\nTHis is a second paragraph still in cursive. THis paragraph should contain five toal lines of text. This sentence should form the fifth line.\nThis paragraph contains printed text. Will printed text be better recognized than cursive?\nThis is more text to fill the page: TrOCR (at the time of this writing) seems likely the require more work than Kraken to create an end-to-end HTR pipeline."
}